scripts/exp2/redis-sls-200-06.txt
====== PING_INLINE ======
  100000 requests completed in 2.78 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 0.3 milliseconds
0.02% <= 0.4 milliseconds
0.26% <= 0.5 milliseconds
5.62% <= 0.6 milliseconds
42.67% <= 0.7 milliseconds
85.52% <= 0.8 milliseconds
97.09% <= 0.9 milliseconds
98.18% <= 1.0 milliseconds
98.30% <= 1.1 milliseconds
98.35% <= 1.2 milliseconds
98.39% <= 1.3 milliseconds
98.44% <= 1.4 milliseconds
98.50% <= 1.5 milliseconds
98.56% <= 1.6 milliseconds
98.62% <= 1.7 milliseconds
98.68% <= 1.8 milliseconds
98.74% <= 1.9 milliseconds
98.81% <= 2.0 milliseconds
98.81% <= 2 milliseconds
99.25% <= 3 milliseconds
99.39% <= 4 milliseconds
99.42% <= 5 milliseconds
99.47% <= 6 milliseconds
99.55% <= 7 milliseconds
99.65% <= 8 milliseconds
99.67% <= 9 milliseconds
99.75% <= 10 milliseconds
99.80% <= 11 milliseconds
99.85% <= 12 milliseconds
99.89% <= 13 milliseconds
99.90% <= 17 milliseconds
99.90% <= 18 milliseconds
99.95% <= 21 milliseconds
99.96% <= 22 milliseconds
100.00% <= 22 milliseconds
35958.29 requests per second

====== PING_BULK ======
  100000 requests completed in 2.82 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.24% <= 1 milliseconds
98.90% <= 2 milliseconds
99.33% <= 3 milliseconds
99.40% <= 4 milliseconds
99.44% <= 5 milliseconds
99.50% <= 6 milliseconds
99.55% <= 7 milliseconds
99.59% <= 8 milliseconds
99.60% <= 11 milliseconds
99.63% <= 12 milliseconds
99.65% <= 13 milliseconds
99.67% <= 14 milliseconds
99.70% <= 17 milliseconds
99.76% <= 18 milliseconds
99.80% <= 19 milliseconds
99.83% <= 20 milliseconds
99.85% <= 21 milliseconds
99.95% <= 22 milliseconds
100.00% <= 22 milliseconds
35460.99 requests per second

====== SET ======
  100000 requests completed in 2.81 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.44% <= 1 milliseconds
99.00% <= 2 milliseconds
99.35% <= 3 milliseconds
99.35% <= 4 milliseconds
99.39% <= 5 milliseconds
99.41% <= 6 milliseconds
99.47% <= 7 milliseconds
99.53% <= 8 milliseconds
99.60% <= 11 milliseconds
99.67% <= 12 milliseconds
99.70% <= 13 milliseconds
99.71% <= 14 milliseconds
99.75% <= 15 milliseconds
99.79% <= 16 milliseconds
99.80% <= 18 milliseconds
99.84% <= 19 milliseconds
99.85% <= 21 milliseconds
99.94% <= 22 milliseconds
100.00% <= 22 milliseconds
35625.22 requests per second

====== GET ======
  100000 requests completed in 2.85 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.17% <= 1 milliseconds
98.78% <= 2 milliseconds
99.21% <= 3 milliseconds
99.29% <= 4 milliseconds
99.30% <= 5 milliseconds
99.30% <= 6 milliseconds
99.35% <= 9 milliseconds
99.43% <= 10 milliseconds
99.55% <= 11 milliseconds
99.64% <= 12 milliseconds
99.67% <= 13 milliseconds
99.71% <= 14 milliseconds
99.75% <= 16 milliseconds
99.78% <= 17 milliseconds
99.82% <= 18 milliseconds
99.85% <= 19 milliseconds
99.95% <= 21 milliseconds
99.99% <= 22 milliseconds
100.00% <= 22 milliseconds
35075.41 requests per second

====== INCR ======
  100000 requests completed in 2.76 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.49% <= 1 milliseconds
99.02% <= 2 milliseconds
99.38% <= 3 milliseconds
99.40% <= 4 milliseconds
99.45% <= 5 milliseconds
99.50% <= 6 milliseconds
99.60% <= 7 milliseconds
99.64% <= 8 milliseconds
99.68% <= 9 milliseconds
99.78% <= 10 milliseconds
99.80% <= 11 milliseconds
99.87% <= 12 milliseconds
99.90% <= 13 milliseconds
99.94% <= 14 milliseconds
99.95% <= 21 milliseconds
99.97% <= 22 milliseconds
100.00% <= 22 milliseconds
36192.54 requests per second

====== LPUSH ======
  100000 requests completed in 2.82 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.83% <= 1 milliseconds
98.86% <= 2 milliseconds
99.26% <= 3 milliseconds
99.31% <= 4 milliseconds
99.35% <= 7 milliseconds
99.39% <= 8 milliseconds
99.40% <= 9 milliseconds
99.50% <= 10 milliseconds
99.64% <= 11 milliseconds
99.70% <= 12 milliseconds
99.70% <= 13 milliseconds
99.75% <= 14 milliseconds
99.75% <= 15 milliseconds
99.78% <= 16 milliseconds
99.81% <= 17 milliseconds
99.86% <= 18 milliseconds
99.90% <= 19 milliseconds
99.91% <= 20 milliseconds
99.95% <= 21 milliseconds
99.99% <= 22 milliseconds
100.00% <= 22 milliseconds
35410.77 requests per second

====== RPUSH ======
  100000 requests completed in 2.83 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.97% <= 1 milliseconds
98.82% <= 2 milliseconds
99.31% <= 3 milliseconds
99.39% <= 4 milliseconds
99.40% <= 6 milliseconds
99.42% <= 7 milliseconds
99.48% <= 8 milliseconds
99.51% <= 9 milliseconds
99.55% <= 11 milliseconds
99.60% <= 12 milliseconds
99.65% <= 13 milliseconds
99.67% <= 14 milliseconds
99.73% <= 15 milliseconds
99.75% <= 16 milliseconds
99.78% <= 17 milliseconds
99.82% <= 18 milliseconds
99.85% <= 21 milliseconds
99.94% <= 22 milliseconds
100.00% <= 22 milliseconds
35360.68 requests per second

====== LPOP ======
  100000 requests completed in 2.85 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.52% <= 1 milliseconds
98.53% <= 2 milliseconds
99.18% <= 3 milliseconds
99.20% <= 4 milliseconds
99.25% <= 5 milliseconds
99.33% <= 6 milliseconds
99.39% <= 7 milliseconds
99.40% <= 8 milliseconds
99.45% <= 9 milliseconds
99.50% <= 11 milliseconds
99.59% <= 12 milliseconds
99.66% <= 13 milliseconds
99.72% <= 14 milliseconds
99.80% <= 15 milliseconds
99.80% <= 17 milliseconds
99.83% <= 18 milliseconds
99.90% <= 19 milliseconds
99.90% <= 21 milliseconds
99.93% <= 22 milliseconds
99.98% <= 23 milliseconds
100.00% <= 23 milliseconds
35137.04 requests per second

====== RPOP ======
  100000 requests completed in 2.88 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.56% <= 1 milliseconds
98.58% <= 2 milliseconds
99.28% <= 3 milliseconds
99.35% <= 4 milliseconds
99.35% <= 5 milliseconds
99.38% <= 6 milliseconds
99.40% <= 11 milliseconds
99.43% <= 12 milliseconds
99.61% <= 13 milliseconds
99.65% <= 15 milliseconds
99.69% <= 16 milliseconds
99.74% <= 17 milliseconds
99.80% <= 18 milliseconds
99.80% <= 21 milliseconds
99.92% <= 22 milliseconds
100.00% <= 22 milliseconds
34746.35 requests per second

====== SADD ======
  100000 requests completed in 2.84 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.13% <= 1 milliseconds
98.80% <= 2 milliseconds
99.31% <= 3 milliseconds
99.43% <= 4 milliseconds
99.54% <= 5 milliseconds
99.60% <= 6 milliseconds
99.60% <= 7 milliseconds
99.65% <= 8 milliseconds
99.70% <= 11 milliseconds
99.75% <= 16 milliseconds
99.80% <= 17 milliseconds
99.85% <= 21 milliseconds
99.94% <= 22 milliseconds
100.00% <= 22 milliseconds
35260.93 requests per second

====== HSET ======
  100000 requests completed in 2.82 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.73% <= 1 milliseconds
98.69% <= 2 milliseconds
99.26% <= 3 milliseconds
99.30% <= 4 milliseconds
99.32% <= 5 milliseconds
99.35% <= 7 milliseconds
99.41% <= 8 milliseconds
99.45% <= 9 milliseconds
99.50% <= 11 milliseconds
99.59% <= 12 milliseconds
99.71% <= 13 milliseconds
99.75% <= 14 milliseconds
99.83% <= 15 milliseconds
99.85% <= 16 milliseconds
99.89% <= 17 milliseconds
99.90% <= 21 milliseconds
99.96% <= 22 milliseconds
100.00% <= 22 milliseconds
35423.31 requests per second

====== SPOP ======
  100000 requests completed in 2.89 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.26% <= 1 milliseconds
98.78% <= 2 milliseconds
99.29% <= 3 milliseconds
99.35% <= 11 milliseconds
99.50% <= 12 milliseconds
99.60% <= 13 milliseconds
99.65% <= 14 milliseconds
99.70% <= 15 milliseconds
99.75% <= 16 milliseconds
99.83% <= 17 milliseconds
99.87% <= 18 milliseconds
99.90% <= 21 milliseconds
99.94% <= 22 milliseconds
100.00% <= 23 milliseconds
100.00% <= 23 milliseconds
34614.05 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 2.83 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.57% <= 1 milliseconds
98.68% <= 2 milliseconds
99.17% <= 3 milliseconds
99.25% <= 4 milliseconds
99.32% <= 5 milliseconds
99.34% <= 6 milliseconds
99.39% <= 7 milliseconds
99.49% <= 8 milliseconds
99.55% <= 11 milliseconds
99.64% <= 12 milliseconds
99.75% <= 13 milliseconds
99.78% <= 14 milliseconds
99.85% <= 15 milliseconds
99.88% <= 16 milliseconds
99.90% <= 21 milliseconds
99.96% <= 22 milliseconds
100.00% <= 22 milliseconds
35348.18 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 3.46 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

93.14% <= 1 milliseconds
98.56% <= 2 milliseconds
99.11% <= 3 milliseconds
99.15% <= 7 milliseconds
99.17% <= 8 milliseconds
99.39% <= 9 milliseconds
99.67% <= 10 milliseconds
99.75% <= 11 milliseconds
99.75% <= 14 milliseconds
99.76% <= 15 milliseconds
99.79% <= 16 milliseconds
99.83% <= 17 milliseconds
99.86% <= 18 milliseconds
99.90% <= 19 milliseconds
99.94% <= 20 milliseconds
99.95% <= 21 milliseconds
99.97% <= 22 milliseconds
100.00% <= 22 milliseconds
28893.38 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 5.78 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
97.25% <= 2 milliseconds
97.90% <= 3 milliseconds
98.49% <= 4 milliseconds
98.61% <= 5 milliseconds
98.69% <= 6 milliseconds
98.78% <= 7 milliseconds
98.86% <= 8 milliseconds
98.94% <= 9 milliseconds
98.98% <= 10 milliseconds
99.00% <= 11 milliseconds
99.04% <= 12 milliseconds
99.17% <= 13 milliseconds
99.30% <= 14 milliseconds
99.41% <= 15 milliseconds
99.50% <= 16 milliseconds
99.58% <= 17 milliseconds
99.64% <= 18 milliseconds
99.71% <= 19 milliseconds
99.74% <= 20 milliseconds
99.75% <= 21 milliseconds
99.78% <= 22 milliseconds
99.89% <= 23 milliseconds
99.96% <= 24 milliseconds
100.00% <= 24 milliseconds
17298.04 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 7.11 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
97.81% <= 2 milliseconds
99.06% <= 3 milliseconds
99.27% <= 4 milliseconds
99.42% <= 5 milliseconds
99.46% <= 6 milliseconds
99.49% <= 7 milliseconds
99.51% <= 8 milliseconds
99.53% <= 9 milliseconds
99.54% <= 10 milliseconds
99.54% <= 11 milliseconds
99.57% <= 12 milliseconds
99.64% <= 13 milliseconds
99.69% <= 14 milliseconds
99.75% <= 15 milliseconds
99.80% <= 16 milliseconds
99.82% <= 17 milliseconds
99.86% <= 18 milliseconds
99.90% <= 19 milliseconds
99.92% <= 20 milliseconds
99.94% <= 21 milliseconds
99.95% <= 22 milliseconds
99.96% <= 23 milliseconds
99.98% <= 24 milliseconds
99.99% <= 25 milliseconds
100.00% <= 26 milliseconds
100.00% <= 26 milliseconds
14066.68 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 7.94 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
56.15% <= 2 milliseconds
99.84% <= 3 milliseconds
99.89% <= 4 milliseconds
99.93% <= 5 milliseconds
99.97% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 7 milliseconds
12592.87 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 2.67 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.78% <= 1 milliseconds
99.97% <= 2 milliseconds
100.00% <= 2 milliseconds
37411.15 requests per second